x = 38

print("Здравствуйте!")
if x < 0:
    print(x, "меньше нуля")
print("До свидания!")


# примеры

a, b = 10, 5

if a > b:
    print("a > b --", a, ">", b, "\n")

print(">", b, "and", a, "> 0 ???")
if a > b and a > 0:
    print("Успех\n")

print("(", a, ">", b, ") and (", a, "> 0 or", b, "< 1000) ???")
if (a > b) and (a > 0 or b < 1000):
    print("Успех\n")

print("5 <", b, "and", b, "< 10 ???")
if 5 < b and b < 10:
    print("Успех\n")


# можно сравнивать числа, строки, списки

print("'34' > '123' ???")
if '34' > '123':
    print("Успех\n")

print('"123" > "12" ???')
if "123" > "12":
    print("Успех\n")

print("[1, 2] > [1, 1] ???")
if [1, 2] > [1, 1]:
    print("Успех\n")


# что нельзя сравнивать - разные типы
# print('"6" > 5')
# if "6" > 5:
#     print("Успех\n")
#
# print("[5, 6] > 5")
# if [5, 6] > 5:
#     print("Успех\n")


# но

print('"6" != 5')
if "6" != 5:
    print("Успех\n")